
## Plan Result (demo)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 1 to change, 5 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
* Update
  * azurerm_resource_group.rg
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS-v16
  * azurerm_key_vault_secret.POSTGRES-USER-v16
  * azurerm_key_vault_secret.POSTGRES_DATABASE-v16
  * azurerm_key_vault_secret.POSTGRES_HOST-v16
  * azurerm_key_vault_secret.POSTGRES_PORT-v16


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo"
      + name                    = "profile-sync-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS-v16" {
      - content_type            = "" -> null
      - id                      = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-PASS-v16/cc187b0af5ab429cbda329c671af93b5" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo" -> null
      - name                    = "profile-sync-POSTGRES-PASS-v16" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-PASS-v16/versions/cc187b0af5ab429cbda329c671af93b5" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-PASS-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "cc187b0af5ab429cbda329c671af93b5" -> null
      - versionless_id          = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-PASS-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo"
      + name                    = "profile-sync-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER-v16" {
      - id                      = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-USER-v16/2304bc4a04044025830adfa2e3f7668c" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo" -> null
      - name                    = "profile-sync-POSTGRES-USER-v16" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-USER-v16/versions/2304bc4a04044025830adfa2e3f7668c" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-USER-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "2304bc4a04044025830adfa2e3f7668c" -> null
      - versionless_id          = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-USER-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo"
      + name                    = "profile-sync-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-v16" {
      - id                      = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-DATABASE-v16/9ddf6f7a018d495fb155780473a39e36" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo" -> null
      - name                    = "profile-sync-POSTGRES-DATABASE-v16" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-DATABASE-v16/versions/9ddf6f7a018d495fb155780473a39e36" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-DATABASE-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "9ddf6f7a018d495fb155780473a39e36" -> null
      - versionless_id          = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-DATABASE-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo"
      + name                    = "profile-sync-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST-v16" {
      - id                      = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-HOST-v16/9af28cf52fa84f2480105ae8a3532ae5" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo" -> null
      - name                    = "profile-sync-POSTGRES-HOST-v16" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-HOST-v16/versions/9af28cf52fa84f2480105ae8a3532ae5" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-HOST-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "9af28cf52fa84f2480105ae8a3532ae5" -> null
      - versionless_id          = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-HOST-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo"
      + name                    = "profile-sync-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT-v16" {
      - id                      = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-PORT-v16/85f2afdacc3c47ddb858f8a283bc9112" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo" -> null
      - name                    = "profile-sync-POSTGRES-PORT-v16" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-PORT-v16/versions/85f2afdacc3c47ddb858f8a283bc9112" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo/secrets/profile-sync-POSTGRES-PORT-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "85f2afdacc3c47ddb858f8a283bc9112" -> null
      - versionless_id          = "https://rd-demo.vault.azure.net/secrets/profile-sync-POSTGRES-PORT-v16" -> null
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-profile-sync-demo"
        name     = "rd-profile-sync-demo"
      ~ tags     = {
          - "Deployment Environment" = "demo"
          - "Team Name"              = "RD"
          - "lastUpdated"            = "2024-05-15T11:02:58Z"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":853,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->